---
kind: property
id: P:Autodesk.Revit.DB.FabricationServiceButton.IsAHanger
source: html/33a1bf43-d48a-df09-e6c7-d4dd81ed3cbc.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.IsAHanger Property

Checks if the fabrication service button is hanger.

## Syntax (C#)
```csharp
public bool IsAHanger { get; }
```